(function (MW) {
  'use strict';

  const TREATMENT_UNITS = [
            "محرقة بلقاس", "محرقة تمي الأمديد", "محرقة صدر بهوت", "محرقة ميت غمر",
            "محرقة شبراهور هوفال", "محرقة شبراهور المعصرة", "مفرمة أولاد صبور", "مفرمة نبروه"
        ];

  const CARS = [
            "1234 د ط أ", "5678 د ط أ", "9101 د ط أ", "1122 د ط أ"
        ];

  const DRIVERS = [
            "عرفات فهيم محمود", "حمدين كامل إبراهيم شومان", "شريف المتولي طلبه عبده",
            "هاني شاهين سلطان محمد", "السيد السيد أحمد جبر", "أحمد السلاوي منيع موسي",
            "رمضان محمد ياسين موسي", "الحسين عوض العدل علي", "خالد إبراهيم عبد العزيز",
            "فتحي أبوسريع حسين رضوان", "الشربيني محمد محمد محمد", "حاتم ابراهيم محمد"
        ];

  const HEALTH_ADMINS = {
            "الادارة الصحية بالمنصورة": [
                "مكتب صحة أول", "مكتب صحة ثان", "مكتب صحة ثالث", "مكتب صحة توريل", "رعاية أول", "المركز الصحي", "احيائية رابع", "احيائية جديلة", "احيائية الفردوس", "احيائية ميت حدر", "احيائية عزبة الشال", "احيائية سندوب", "مركز صحة اسرة منية سندوب", "مركز صحة اسرة شاوة", "مركز صحة اسرة طناح", "مركز صحة اسرة البرامون", "مركز صحة اسرة سلامون القماش", "مركز صحة اسرة شها", "مركز صحة اسرة ميت مزاح", "مركز صحة اسرة كوم الدربي", "مركز صحة اسرة اويش الحجر", "مركز صحة اسرة شبرا بدين", "وحدة صحة اسرة قولونجيل", "وحدة صحة اسرة ميت محمود", "وحدة صحة اسرة كرم الجديدة", "وحدة صحة اسرة النسيمية", "وحدة صحة اسرة سللنت", "وحدة صحة أسرة المالحة", "وحدة صحة أسرة جديدة الهالة", "وحدة صحة أسرة نقيطة", "وحدة صحة أسرة ميت لوزة", "وحدة صحة أسرة ميت الصارم", "وحدة صحة أسرة الخليج", "وحدة صحة أسرة كفر بدواى", "وحدة صحة أسرة ميت جراح", "وحدة صحة أسرة كوم بنى مراس", "وحدة صحة أسرة بدين", "وحدة صحة أسرة البقلية", "وحدة صحة أسرة برق العز", "وحدة صحة أسرة ميت على", "وحدة صحة أسرة سلكا", "وحدة صحة أسرة الخيارية", "وحدة صحة أسرة كفر البرامون", "وحدة صحة أسرة طرانيس البحر", "وحدة صحة أسرة ميت خميس", "وحدة صحة أسرة الدنابيق", "وحدة صحة أسرة الريدانية", "وحدة صحة أسرة بدواي", "وحدة صحة أسرة البدالة", "وحدة صحة أسرة النزهة", "وحدة صحة أسرة تلبانه", "وحدة صحة أسرة بلجاى", "وحدة صحة أسرة كفر طناح", "عيادة فرعية رزق الله"
            ],
            "الادارة الصحية بأجا": [
                "مكتب صحة اجا", "رعاية اجا", "مركز صحة أسرة شبراويش", "مركز صحة أسرة صهرجت الصغرى", "مركز صحة أسرة منية سمنود", "مركز صحة أسرة ميت دمسيس", "مركز صحة أسرة سنجيد", "مركز صحة أسرة اخطاب", "مركز صحة أسرة نوسا الغيط", "وحدة صحة أسرة الديرس", "وحدة صحة أسرة سماحة", "وحدة صحة أسرة كفر المندرة", "وحدة صحة أسرة بقطارس", "وحدة صحة أسرة كفر عوض", "وحدة صحة أسرة الدير", "وحدة صحة أسرة شنفاس", "وحدة صحة أسرة السبخا", "وحدة صحة أسرة الغراقة", "وحدة صحة أسرة شنيسة", "وحدة صحة أسرة جراح", "وحدة صحة أسرة ابو داوود العنب", "وحدة صحة أسرة طنامل الشرقى", "وحدة صحة أسرة طنامل الغربى", "وحدة صحة أسرة ميت ابو الحسين", "وحدة صحة أسرة ميت العامل", "وحدة صحة أسرة شيوة الغربية", "وحدة صحة أسرة ميت معاند", "وحدة صحة أسرة البساتين", "وحدة صحة أسرة نوسا البحر", "وحدة صحة أسرة برج النور", "وحدة صحة أسرة البهو فريك", "وحدة صحة أسرة ميت فضالة", "وحدة صحة أسرة ميت مسعود", "وحدة صحة أسرة كفر الشراقوة", "وحدة صحة أسرة دروة", "وحدة صحة أسرة ميت ابو الحارث", "وحدة صحة أسرة ميت اشنا", "عيادة السلامية", "عيادة سنبخت"
            ],
            "الادارة الصحية بميت غمر": [
                "مكتب صحة دقادوس", "مكتب صحة ميت غمر", "مكتب صحة كوم النور", "مكتب صحة اتميدة", "مكتب صحة دماص", "رعاية أ ول", "رعاية دقادوس", "إحيائية ميت غمر", "إحيائية دقادوس", "مركز صحة أسرة كفر المقدام", "مركز صحة أسرة أوليلة", "مركز صحة أسرة كوم النور", "مركز صحة أسرة كفر بهيدة", "مركز صحة أسرة ميت محسن", "مركز صحة أسرة بشلا", "مركز صحة أسرة ميت الفرماوي", "مركز صحة أسرة صهرجت الكبري", "مركز صحة أسرة سنفا", "مركز صحة أسرة تفهنا الاشراف", "وحدة صحة أسرة كفر الوزير", "وحدة صحة أسرة كفر المحمدية", "وحدة صحة أسرة المعصرة", "وحدة صحة أسرة كفورالبهايتة", "وحدة صحة أسرة دنديط", "وحدة صحة أسرة بهيدة", "وحدة صحة أسرة الرحمانية", "وحدة صحة أسرة كفر سرنجا", "وحدة صحة أسرة سمبو مقام", "وحدة صحة أسرة ابو نبهان", "وحدة صحة أسرة ميت العز", "وحدة صحة أسرة هلا", "وحدة صحة أسرة بشالوش", "وحدة صحة أسرة سنتماي", "وحدة صحة أسرة ميت يعيش", "وحدة صحة أسرة ميت ناجى", "وحدة صحة أسرة جصفا", "وحدة صحة أسرة ميت أبو خالد", "وحدة صحة أسرة الهجرسي", "وحدة صحة أسرة البوها", "وحدة صحة أسرة الديونية", "وحدة صحة أسرة كفر ميت العز", "وحدة صحة أسرة القيطون", "وحدة صحة أسرة سرنجا", "وحدة صحة أسرة كفر الشيخ هلال", "وحدة صحة أسرة كفر نعمان", "وحدة صحة أسرة كفر الشراقوة", "وحدة صحة أسرة ميت القرشي"
            ],
            "الادارة الصحية بالسنبلاوين": [
                "مكتب صحة السنبلاوين", "مكتب صحة شبرا سندى", "مكتب صحة المقاطعة", "مكتب صحة شبراهور", "رعاية السنبلاوين", "مركز صحة أسرة البلامون", "مركز صحة أسرة العنانية", "مركز صحة أسرة طوخ الأقلام", "مركز صحة أسرة كفر غنام", "مركز صحة أسرة غزالة", "مركز صحة أسرة ميت غريطة", "مركز صحة أسرة ديو الوسطى", "وحدة صحة أسرة الحصاينة", "وحدة صحة أسرة السرسى", "وحدة صحة أسرة طهواى", "وحدة صحة أسرة الزريقى", "وحدة صحة أسرة طرانيس العرب", "وحدة صحة أسرة كفر الروك", "وحدة صحة أسرة الزهايرة", "وحدة صحة أسرة بشمس", "وحدة صحة أسرة شبراقبالة", "وحدة صحة أسرة الأورمان", "وحدة صحة أسرة نوب طريف", "وحدة صحة أسرة ميت غراب", "وحدة صحة أسرة منشأة هلال", "وحدة صحة أسرة طنبول الكبرى", "وحدة صحة أسرة الرمزية", "وحدة صحة أسرة السلام", "وحدة صحة أسرة الجلايلة", "وحدة صحة أسرة قرقيرة", "وحدة صحة أسرة كفر الشرفا", "وحدة صحة أسرة منشأة عزت", "وحدة صحة أسرة البشنينى", "وحدة صحة أسرة الحجايزة", "وحدة صحة أسرة ابوالقراميط", "وحدة صحة أسرة الحصوة", "وحدة صحة أسرة كفر سعد", "وحدة صحة أسرة طماى الزهايرة", "وحدة صحة أسرة كفر بنى سالم", "وحدة صحة أسرة البكارية", "وحدة صحة أسرة كفر عزام", "وحدة صحة أسرة كفر الشهيد حمودة", "وحدة صحة أسرة كفر طنبول القديم", "وحدة صحة أسرة التمد الحجر", "وحدة صحة أسرة حسين فهمى", "وحدة صحة أسرة برقين", "وحدة صحة أسرة الحاجة سكينة", "وحدة صحة أسرة برج نور العرب"
            ],
            "الادارة الصحية بدكرنس": [
                "مكتب صحة دكرنس", "رعاية دكرنس", "مركز صحة أسرة دموه", "مركز صحة أسرة ميت ضافر", "مركز صحة أسرة نجير", "وحدة صحة أسرة كفر عبد المؤمن", "وحدة صحة أسرة جزيرة القباب", "وحدة صحة أسرة القباب الصغرى", "وحدة صحة أسرة الزهايرة", "وحدة صحة أسرة العزازنة", "وحدة صحة أسرة ميت النحال", "وحدة صحة أسرة ميت السودان", "وحدة صحة أسرة الكرما", "وحدة صحة أسرة السلام", "وحدة صحة أسرة عرب شراويد", "وحدة صحة أسرة الحساينة", "وحدة صحة أسرة النهضة", "وحدة صحة أسرة منشأة عبد الرحمن", "وحدة صحة أسرة المرساة", "وحدة صحة أسرة ديمشلت", "وحدة صحة أسرة ابو طه", "وحدة صحة أسرة ميت طريف", "وحدة صحة أسرة المحمودية", "وحدة صحة أسرة الربيعة", "وحدة صحة أسرة أشمون الرمان", "وحدة صحة أسرة الحرية", "عيادة الربعمائة", "منشأة ناصر"
            ],
            "الادارة الصحية ببني عبيد": [
                "مكتب صحة ببني عبيد", "وحدة صحة أسرة الديسة", "وحدة صحة أسرة ديرب الخضر", "وحدة صحة أسرة مبارك", "وحدة صحة أسرة ميت عدلان", "وحدة صحة أسرة اليوسفية", "وحدة صحة أسرة ميت فارس", "وحدة صحة أسرة ميت سويد", "وحدة صحة أسرة الحدادة", "وحدة صحة أسرة الصلاحات", "وحدة صحة أسرة طلمبات بنى عبيد", "وحدة صحة أسرة منشأة مصبح", "وحدة صحة أسرة ابو المعاطى الباز", "وحدة صحة أسرة الزهيرى", "وحدة صحة أسرة طلعت"
            ],
            "الادارة الصحية بميت سلسيل": [
                "مكتب صحة ميت سلسيل", "رعاية ميت سلسيل", "مركز صحة أسرة عزب الاتحاد", "مركز صحة أسرة الكفر الجديد", "وحدة صحة أسرة النظارة", "وحدة صحة أسرة الجوابر", "وحدة صحة أسرة الإتحاد", "وحدة صحة أسرة القرمة"
            ],
            "الادارة الصحية بالجمالية": [
                "مكتب صحة الجمالية", "مركز حضري الجمالية", "وحدة صحة أسرة ميت مرجا", "وحدة صحة أسرة عزب الجمالية", "وحدة صحة أسرة عزب موسى", "الوصيف الدواخلي", "وحدة صحة أسرة مبارك", "وحدة صحة أسرة عزب عنبر", "وحدة صحة أسرة لسا الجمالية", "وحدة صحة أسرة عزبة عبده (المسرب)"
            ],
            "الادارة الصحية بتمي الأمديد": [
                "مكتب صحة تمي الامديد", "عيادة حي تمي الامديد", "مركز صحة أسرة الربع", "مركز صحة أسرة تاج العز", "مركز صحة أسرة صدقا", "مركز صحة أسرة أبو داوود السباخ", "وحدة صحة أسرة كفر الأمير", "وحدة صحة أسرة صبرى أبو علم", "وحدة صحة أسرة الخمسة", "وحدة صحة أسرة الصفا", "وحدة صحة أسرة الشرفا", "وحدة صحة أسرة البيضا", "وحدة صحة أسرة الميهى", "وحدة صحة أسرة أبو ياسين", "وحدة صحة أسرة السمارة", "وحدة صحة أسرة ظفر", "وحدة صحة أسرة السعودية", "وحدة صحة أسرة كفر سنجاب", "وحدة صحة أسرة منشأة السلام", "وحدة صحة أسرة الكمال"
            ],
            "الادارة الصحية بمنية النصر": [
                "مكتب صحة منية النصر", "مكتب صحة الكردى", "رعاية منية النصر", "رعاية الكردى", "مركز صحة أسرة برمبال القديم", "مركز صحة أسرة النزل", "مركز صحة أسرة البجلات", "وحدة صحة أسرة منشأة الجمال", "وحدة صحة أسرة الجنينة", "وحدة صحة أسرة الدراكسة", "وحدة صحة أسرة ميت عاصم", "وحدة صحة أسرة غنيم شطا", "وحدة صحة أسرة ميت الخولى", "وحدة صحة أسرة ميت تمامة", "وحدة صحة أسرة كفر علام", "وحدة صحة أسرة مصطفى سليم", "وحدة صحة أسرة الخضيرى", "وحدة صحة أسرة الحاجة رتيبة", "وحدة صحة أسرة الطاهرى", "وحدة صحة أسرة برمبال الجديدة", "وحدة صحة أسرة منشأة مبارك", "وحدة صحة أسرة كفر الكردى", "عيادة فرعية ميت طاهر", "عيادة فرعية الحميدية"
            ],
            "الادارة الصحية بشربين": [
                "مكتب صحة شربين", "رعاية شربين", "مركز صحة أسرة رأس الخليج", "مركز صحة أسرة كفر الأطرش", "مركز صحة أسرة كفر الوكالة", "مركز صحة أسرة بساط كريم الدين", "مركز صحة أسرة الحاج شربينى", "وحدة صحة أسرة أبوزاهر", "وحدة صحة أسرة العوضية", "وحدة صحة أسرة البرامنة", "وحدة صحة أسرة منشأة النصر", "وحدة صحة أسرة منشأة مبارك", "وحدة صحة أسرة دنجواى", "وحدة صحة أسرة الشيخ عطية", "وحدة صحة أسرة السعادوة", "وحدة صحة أسرة كفر الدبوسى", "وحدة صحة أسرة كفر الحطبة", "وحدة صحة أسرة كفر الشناوى", "وحدة صحة أسرة مقرى الحصص", "وحدة صحة أسرة الحصص", "وحدة صحة أسرة العيادية", "وحدة صحة أسرة كفر الترعة القديم", "وحدة صحة أسرة أبو سيد أحمد", "وحدة صحة أسرة ابو شعير", "وحدة صحة أسرة محلة انجاق", "وحدة صحة أسرة الصبرية", "وحدة صحة أسرة العبد", "وحدة صحة أسرة ترعة غنيم", "وحدة صحة أسرة بطرس", "وحدة صحة أسرة البوشة", "وحدة صحة أسرة ام الرزق", "وحدة صحة أسرة الجلاوينة", "وحدة صحة أسرة ابو جلال", "وحدة صحة أسرة الضهرية 1", "وحدة صحة أسرة الاحمدية", "وحدة صحة أسرة موسي شكرى", "وحدة صحة أسرة كفر الترعة الجديد", "وحدة صحة أسرة الضهرية 2", "وحدة صحة أسرة كفر يوسف", "وحدة صحة أسرة منشأة عزت", "عيادة حي الشيخ سميط", "عيادة حي عزبة البط"
            ],
            "الادارة الصحية بالمنزلة": [
                "مكتب صحة المنزلة", "رعاية اول", "مركز حضري المنزلة", "مركز صحة أسرة النسايمة", "مركز صحة أسرة العزيزة", "مركز صحة أسرة البصراط", "وحدة صحة أسرة بنى هلال", "وحدة صحة أسرة الطوابرة", "وحدة صحة أسرة المواجد", "وحدة صحة أسرة جديدة المنزلة", "وحدة صحة أسرة الأحمدية", "وحدة صحة أسرة الشبول", "وحدة صحة أسرة الفروسات", "وحدة صحة أسرة أبو الأخضر", "وحدة صحة أسرة العبيدى صبح", "وحدة صحة أسرة العامرة القديمة", "وحدة صحة أسرة أولاد ناصر", "وحدة صحة أسرة القطشة", "وحدة صحة أسرة الدقانوة", "وحدة صحة أسرة كفر حجاج", "وحدة صحة أسرة العامرة الجديدة", "وحدة صحة أسرة العربان", "وحدة صحة أسرة عرفات شلباية", "وحدة صحة أسرة الحوتة", "وحدة صحة أسرة أولاد حانا", "وحدة صحة أسرة الرودة", "وحدة صحة أسرة العمارنة", "وحدة صحة أسرة عرب زيدان", "وحدة صحة أسرة الستايتة", "وحدة صحة أسرة الطويل"
            ],
            "الادارة الصحية ببلقاس": [
                "مكتب صحة بلقاس", "رعاية بلقاس", "مركز صحة أسرة الشوامى", "مركز صحة أسرة بسنديلة", "مركز صحة أسرة بلقاس خامس", "مركز صحة أسرة الستامونى", "مركز صحة أسرة الأحمدية", "مركز صحة أسرة الأمل", "مركز صحة أسرة المعصرة", "وحدة صحة أسرة الروضة", "وحدة صحة أسرة أبوشريف", "وحدة صحة أسرة القنان", "وحدة صحة أسرة الخلالة", "وحدة صحة أسرة الملعب", "وحدة صحة أسرة الدمايرة", "وحدة صحة أسرة الحفير", "وحدة صحة أسرة أبودشيشة", "وحدة صحة أسرة قلبشو", "وحدة صحة أسرة 53 أبوماضى", "وحدة صحة أسرة 57 أبوماضى", "وحدة صحة أسرة كفر الغنامة", "وحدة صحة أسرة جاليا", "وحدة صحة أسرة شرقية المعصرة", "وحدة صحة أسرة عصفور", "وحدة صحة أسرة العريض", "وحدة صحة أسرة 49 درافيل", "وحدة صحة أسرة الخزان", "وحدة صحة أسرة تل عميرة", "وحدة صحة أسرة السماحية", "وحدة صحة أسرة دملاش", "وحدة صحة أسرة جاليا الأولى", "وحدة صحة أسرة الدوير", "وحدة صحة أسرة الجوادية", "وحدة صحة أسرة الشلطيطة", "وحدة صحة أسرة 28 بصار", "وحدة صحة أسرة البغدادى", "وحدة صحة أسرة الخازندار", "وحدة صحة أسرة أبوطه", "وحدة صحة أسرة 51 أبوماضى", "وحدة صحة أسرة 31 بصار", "وحدة صحة أسرة السبعة", "وحدة صحة أسرة المستعمرة الشرقية", "وحدة صحة أسرة موسى العربى", "وحدة صحة أسرة قراش", "وحدة صحة أسرة بحر التبن", "وحدة صحة أسرة 55 ابو ماضي", "وحدة صحة أسرة أبو عرصة", "وحدة صحة أسرة الجوهرى", "وحدة صحة أسرة 37 درافيل", "وحدة صحة أسرة الماكينة", "وحدة صحة أسرة 39 درافيل", "وحدة صحة أسرة السعدنى", "وحدة صحة أسرة وزير", "وحدة صحة أسرة 30 بصار", "عيادة بحر العش", "عيادة الدولتلى"
            ],
            "الادارة الصحية بنبروه": [
                "مكتب صحة نبروه", "رعاية نبروه", "مركز صحة أسرة بانوب", "مركز صحة أسرة الطيبة", "مركز صحة أسرة بهوت", "مركز صحة أسرة درين", "مركز صحة أسرة نشا", "وحدة صحة أسرة طنيخ", "وحدة صحة أسرة تيرة", "وحدة صحة أسرة كفربهوت", "وحدة صحة أسرة كفر الأبحر", "وحدة صحة أسرة الشيخ سليم", "وحدة صحة أسرة أبستو", "وحدة صحة أسرة أفنيش", "وحدة صحة أسرة كفر الدكرورى", "وحدة صحة أسرة ميت عباد", "وحدة صحة أسرة منشأة البدراوى", "وحدة صحة أسرة طبنوها", "وحدة صحة أسرة كفر الجنينة", "وحدة صحة أسرة كفر الحصة", "وحدة صحة أسرة الدروتين", "عيادة فلطس", "عيادة عزبة قطاوي"
            ],
            "الادارة الصحية بطلخا": [
                "مكتب صحة أول", "مكتب صحة ثان", "مكتب صحة بطرة", "رعاية طلخا", "مركز صحة أسرة ديسط", "مركز صحة أسرة كتامة", "مركز صحة أسرة بطرة", "مركز صحة أسرة دميرة", "وحدة صحة أسرة شرنقاش", "وحدة صحة أسرة ميت عنتر", "وحدة صحة أسرة كفر دميرة القديم", "وحدة صحة أسرة كفر دميرة الجديد", "وحدة صحة أسرة الروضة", "وحدة صحة أسرة كفور العرب", "وحدة صحة أسرة ميت زنقر", "وحدة صحة أسرة كفر الطويلة", "وحدة صحة أسرة منشأة البدوى", "وحدة صحة أسرة المنيل", "وحدة صحة أسرة كفر بساط", "وحدة صحة أسرة كفر الخوازم", "وحدة صحة أسرة بساط", "وحدة صحة أسرة كفر العرب", "وحدة صحة أسرة كفر الاصالى", "وحدة صحة أسرة ميت الكرما", "وحدة صحة أسرة سرسق", "وحدة صحة أسرة الطويلة", "عيادة ميت نابت"
            ],
            "الادارة الصحية بجمصة": [
                "مكتب صحة جمصة", "المركز الصحي بالمنصورة الجديدة", "مركز صحة أسرة الجزاير", "وحدة صحة أسرة أبونور الدين", "وحدة صحة أسرة السبخاوية", "وحدة صحة أسرة زيان", "وحدة صحة أسرة منشأة شومان", "وحدة صحة أسرة إصلاح الغيط الكبير", "وحدة صحة أسرة أبو بكر الصديق", "وحدة صحة أسرة السلسول"
            ],
            "الادارة الصحية بالمطرية": [
                "مكتب صحة المطرية", "رعاية المطرية", "مركز صحة أسرة العصافرة", "وحدة صحة أسرة المطرية", "وحدة صحة أسرة الضهير", "وحدة صحة أسرة أولاد صبور", "وحدة صحة أسرة الجماملة", "عيادة حي الشيخ مجاهد"
            ],
            "الادارة الصحية بمحلة دمنة": [
                "مركز طب أسرة محلة دمنة", "وحدة صحة أسرة منشأة السلام", "وحدة صحة أسرة منية محلة دمنة", "وحدة صحة أسرة الناصرة", "وحدة صحة أسرة مبارك"
            ]
        };

  const GOV_FACILITIES = [
                "المجلس الطبى العام (القومسيون)", "المركز الإقليمى لنقل الدم بالمنصورة", "المعمل المشترك - إدارة المعامل", "عيادات التأمين الصحى", "عيادات مستشفى طلخا", "قسم حميات مستشفى ميت غمر", "كلية الصيدلة بجامعة المنصورة", "كلية طب الأسنان بجامعة المنصورة", "مركز تدريب طب الأسنان بالمديرية", "مركز دماص للكبد والجهاز الهضمى", "مركز علاج الأورام بميت غمر", "مستشفى الجلدية والجزام بالمنصورة", "مستشفى المنصورة الدولي", "مستشفى دكرنس العام", "مستشفى صدر المنصورة", "مستشفيات جامعة المنصورة"
            ];

  const PRIVATE_FACILITIES = [
                "مستشفى الصفا التخصصي", "مستشفى الشفاء", "معمل المكتشف الطبي", "مركز النيل للأشعة"
            ];

  const PRIVATE_COMPANIES = [
                "شركة السلام لنقل الخدمات الطبية", "شركة أفروميد للحلول البيئية"
            ];

  MW.SettingsDefaults = Object.freeze({
    treatmentUnits: TREATMENT_UNITS,
    cars: CARS,
    drivers: DRIVERS,
    healthAdmins: HEALTH_ADMINS,
    govFacilities: GOV_FACILITIES,
    privateFacilities: PRIVATE_FACILITIES,
    privateCompanies: PRIVATE_COMPANIES
  });
})(window.MedWaste);